<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

return [
    // 锟斤拷锟捷匡拷锟斤拷锟斤拷
    'type'            => 'mysql',
    // 锟斤拷锟斤拷锟斤拷锟斤拷址
    'hostname'        => '127.0.0.1',
    // 锟斤拷锟捷匡拷锟斤拷
    'database'        => 'helms',
    // 锟矫伙拷锟斤拷
    'username'        => 'root',
    // 锟斤拷锟斤拷
    'password'        => '',
    // 锟剿匡拷
    'hostport'        => '3306',
    // 锟斤拷锟斤拷dsn
    'dsn'             => '',
    // 锟斤拷锟捷匡拷锟斤拷锟接诧拷锟斤拷
    'params'          => [],
    // 锟斤拷锟捷匡拷锟斤拷锟侥拷喜锟斤拷锟絬tf8
    'charset'         => 'utf8',
    // 锟斤拷锟捷匡拷锟角白�
    'prefix'          => 'helms_',
    // 锟斤拷锟捷匡拷锟斤拷锟侥Ｊ�
    'debug'           => true,
    // 锟斤拷锟捷库部锟斤拷式:0 锟斤拷锟斤拷式(锟斤拷一锟斤拷锟斤拷锟斤拷),1 锟街诧拷式(锟斤拷锟接凤拷锟斤拷锟斤拷)
    'deploy'          => 0,
    // 锟斤拷锟捷匡拷锟叫达拷欠锟斤拷锟斤拷 锟斤拷锟斤拷式锟斤拷效
    'rw_separate'     => false,
    // 锟斤拷写锟斤拷锟斤拷锟� 锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷
    'master_num'      => 1,
    // 指锟斤拷锟接凤拷锟斤拷锟斤拷锟斤拷锟�
    'slave_no'        => '',
    // 锟角凤拷锟较革拷锟斤拷锟街讹拷锟角凤拷锟斤拷锟�
    'fields_strict'   => true,
    // 锟斤拷锟捷硷拷锟斤拷锟斤拷锟斤拷锟斤拷
    'resultset_type'  => 'array',
    // 锟皆讹拷写锟斤拷时锟斤拷锟斤拷侄锟�
    'auto_timestamp'  => false,
    // 时锟斤拷锟街讹拷取锟斤拷锟斤拷锟侥拷锟绞憋拷锟斤拷式
    'datetime_format' => 'Y-m-d H:i:s',
    // 锟角凤拷锟斤拷要锟斤拷锟斤拷SQL锟斤拷锟杰凤拷锟斤拷
    'sql_explain'     => false,
];
